cnlohr/ch32v003fun/misc/CH32V003xx.svd
      </registers>
    </peripheral>
    <peripheral>
        <name>IWDG</name>
        <description>Independent watchdog</description>
        <groupName>IWDG</groupName>
        <baseAddress>0x40003000</baseAddress>
        <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        </addressBlock>  
        <registers>
        <register>
            <name>CTLR</name>
            <displayName>CTLR</displayName>
            <description>Key register (IWDG_CTLR)</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>KEY</name>
                <description>Key value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
            </field>
            </fields>
        </register>
        <register>
            <name>PSCR</name>  
            <displayName>PSCR</displayName>
            <description>Prescaler register (IWDG_PSCR)</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>PR</name>
                <description>Prescaler divider</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
            </fields>
        </register>
        <register>
            <name>RLDR</name>
            <displayName>RLDR</displayName>
            <description>Reload register (IWDG_RLDR)</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0FFF</resetValue>
            <fields>
            <field>
                <name>RL</name>
                <description>Watchdog counter reload
                value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
            </field>
            </fields>
        </register>
        <register>
            <name>STATR</name>
            <displayName>STATR</displayName>
            <description>Status register (IWDG_SR)</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>PVU</name>
                <description>Watchdog prescaler value
                update</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>RVU</name>
                <description>Watchdog counter reload value
                update</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            </fields>
        </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>WWDG</name>
        <description>Window watchdog</description>
        <groupName>WWDG</groupName>
        <baseAddress>0x40002C00</baseAddress>
        <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        </addressBlock>
        <interrupt>
        <name>WWDG</name>
        <description>Window Watchdog interrupt</description>
        <value>16</value>
        </interrupt>
        <registers>
        <register>
            <name>CTLR</name>
            <displayName>CTLR</displayName>
            <description>Control register (WWDG_CR)</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x007F</resetValue>
            <fields>
            <field>
                <name>T</name>
                <description>7-bit counter (MSB to LSB)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>WDGA</name>
                <description>Activation bit</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            </fields>
        </register>
        <register>
            <name>CFGR</name>
            <displayName>CFGR</displayName>
            <description>Configuration register
            (WWDG_CFR)</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x007F</resetValue>
            <fields>
            <field>
                <name>W</name>
                <description>7-bit window value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>WDGTB</name>
                <description>Timer Base</description>
                <bitOffset>7</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EWI</name>
                <description>Early Wakeup Interrupt</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            </fields>
        </register>
        <register>
            <name>STATR</name>
            <displayName>STATR</displayName>
            <description>Status register (WWDG_SR)</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>EWIF</name>
                <description>Early Wakeup Interrupt Flag</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            </fields>
        </register>
