cnlohr/ch32v003fun/misc/CH32V003xx.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>TIM1</name>
        <description>Advanced timer</description>
        <groupName>TIM</groupName>
        <baseAddress>0x40012C00</baseAddress>
        <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        </addressBlock>
        <interrupt>
        <name>TIM1BRK</name>
        <description>TIM1 Break
        interrupt</description>
        <value>34</value>
        </interrupt>
        <interrupt>
        <name>TIM1UP</name>
        <description>TIM1 Update 
        interrupt</description>
        <value>35</value>
        </interrupt>
        <interrupt>
        <name>TIM1RG</name>
        <description>TIM1 Trigger and Commutation interrupts</description>
        <value>36</value>
        </interrupt>
        <interrupt>
        <name>TIM1CC</name>
        <description>TIM1 Capture Compare interrupt</description>
        <value>37</value>
        </interrupt>
        <registers>
        <register>
            <name>CTLR1</name>
            <displayName>CTLR1</displayName>
            <description>control register 1</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CAPLVL</name>
                <description>Timer capture level indication
                enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CAPOV</name>
                <description>Timer capture value configuration
                enable</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CKD</name>
                <description>Clock division</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>ARPE</name>
                <description>Auto-reload preload enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CMS</name>
                <description>Center-aligned mode
                selection</description>
                <bitOffset>5</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>DIR</name>
                <description>Direction</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OPM</name>
                <description>One-pulse mode</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>URS</name>
                <description>Update request source</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>UDIS</name>
                <description>Update disable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CEN</name>
                <description>Counter enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CTLR2</name>
            <displayName>CTLR2</displayName>
            <description>control register 2</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>OIS4</name>
                <description>Output Idle state 4</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OIS3N</name>
                <description>Output Idle state 3</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OIS3</name>
                <description>Output Idle state 3</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OIS2N</name>
                <description>Output Idle state 2</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OIS2</name>
                <description>Output Idle state 2</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OIS1N</name>
                <description>Output Idle state 1</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OIS1</name>
                <description>Output Idle state 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>TI1S</name>
                <description>TI1 selection</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>MMS</name>
                <description>Master mode selection</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
            </field>
            <field>
                <name>CCDS</name>
                <description>Capture/compare DMA
                selection</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CCUS</name>
                <description>Capture/compare control update
                selection</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CCPC</name>
                <description>Capture/compare preloaded
                control</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>SMCFGR</name>
            <displayName>SMCFGR</displayName>
            <description>slave mode control register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>ETP</name>
                <description>External trigger polarity</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ECE</name>
                <description>External clock enable</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ETPS</name>
                <description>External trigger prescaler</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ETF</name>
                <description>External trigger filter</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>MSM</name>
                <description>Master/Slave mode</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TS</name>
                <description>Trigger selection</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SMS</name>
                <description>Slave mode selection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
            </fields>
        </register>
        <register>
            <name>DMAINTENR</name>
            <displayName>DMAINTENR</displayName>
            <description>DMA/Interrupt enable register</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>TDE</name>
                <description>Trigger DMA request enable</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>COMDE</name>
                <description>COM DMA request enable</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC4DE</name>
                <description>Capture/Compare 4 DMA request
                enable</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3DE</name>
                <description>Capture/Compare 3 DMA request
                enable</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2DE</name>
                <description>Capture/Compare 2 DMA request
                enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1DE</name>
                <description>Capture/Compare 1 DMA request
                enable</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>UDE</name>
                <description>Update DMA request enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>BIE</name>
                <description>Break interrupt enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>TIE</name>
                <description>Trigger interrupt enable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>COMIE</name>
                <description>COM interrupt enable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC4IE</name>
                <description>Capture/Compare 4 interrupt
                enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3IE</name>
                <description>Capture/Compare 3 interrupt
                enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2IE</name>
                <description>Capture/Compare 2 interrupt
                enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1IE</name>
                <description>Capture/Compare 1 interrupt
                enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>UIE</name>
                <description>Update interrupt enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>INTFR</name>
            <displayName>INTFR</displayName>
            <description>status register</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CC4OF</name>
                <description>Capture/Compare 4 overcapture
                flag</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3OF</name>
                <description>Capture/Compare 3 overcapture
                flag</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2OF</name>
                <description>Capture/compare 2 overcapture
                flag</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1OF</name>
                <description>Capture/Compare 1 overcapture
                flag</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>BIF</name>
                <description>Break interrupt flag</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>TIF</name>
                <description>Trigger interrupt flag</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>COMIF</name>
                <description>COM interrupt flag</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC4IF</name>
                <description>Capture/Compare 4 interrupt
                flag</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3IF</name>
                <description>Capture/Compare 3 interrupt
                flag</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2IF</name>
                <description>Capture/Compare 2 interrupt
                flag</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1IF</name>
                <description>Capture/compare 1 interrupt
                flag</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>UIF</name>
                <description>Update interrupt flag</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>SWEVGR</name>
            <displayName>SWEVGR</displayName>
            <description>event generation register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>BG</name>
                <description>Break generation</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>TG</name>
                <description>Trigger generation</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>COMG</name>
                <description>Capture/Compare control update
                generation</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC4G</name>
                <description>Capture/compare 4
                generation</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3G</name>
                <description>Capture/compare 3
                generation</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2G</name>
                <description>Capture/compare 2
                generation</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1G</name>
                <description>Capture/compare 1
                generation</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>UG</name>
                <description>Update generation</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CHCTLR1_Output</name>
            <displayName>CHCTLR1_Output</displayName>
            <description>capture/compare mode register (output
            mode)</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>OC2CE</name>
                <description>Output Compare 2 clear
                enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC2M</name>
                <description>Output Compare 2 mode</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
            </field>
            <field>
                <name>OC2PE</name>
                <description>Output Compare 2 preload
                enable</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC2FE</name>
                <description>Output Compare 2 fast
                enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2S</name>
                <description>Capture/Compare 2
                selection</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>OC1CE</name>
                <description>Output Compare 1 clear
                enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC1M</name>
                <description>Output Compare 1 mode</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
            </field>
            <field>
                <name>OC1PE</name>
                <description>Output Compare 1 preload
                enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC1FE</name>
                <description>Output Compare 1 fast
                enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1S</name>
                <description>Capture/Compare 1
                selection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CHCTLR1_Input</name>
            <displayName>CHCTLR1_Input</displayName>
            <description>capture/compare mode register 1 (input
            mode)</description>
            <alternateRegister>CHCTLR1_Output</alternateRegister>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>IC2F</name>
                <description>Input capture 2 filter</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
            </field>
            <field>
                <name>IC2PCS</name>
                <description>Input capture 2 prescaler</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>CC2S</name>
                <description>Capture/Compare 2
                selection</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>IC1F</name>
                <description>Input capture 1 filter</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
            </field>
            <field>
                <name>IC1PSC</name>
                <description>Input capture 1 prescaler</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>CC1S</name>
                <description>Capture/Compare 1
                selection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            </fields>
        </register>
